coding/python/函数备忘录.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<!-- 2014-11-10 Mon 21:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 3.X中print()</a></li>
<li><a href="#sec-2">2. lists:</a>
<ul>
<li><a href="#sec-2-1">2.1. list()</a></li>
<li><a href="#sec-2-2">2.2. reverse()</a></li>
<li><a href="#sec-2-3">2.3. sort() sorted()</a></li>
<li><a href="#sec-2-4">2.4. insert()</a></li>
<li><a href="#sec-2-5">2.5. pop([index])</a></li>
<li><a href="#sec-2-6">2.6. remove(value)</a></li>
<li><a href="#sec-2-7">2.7. count(value)</a></li>
</ul>
</li>
<li><a href="#sec-3">3. integers:</a>
<ul>
<li><a href="#sec-3-1">3.1. ord()</a></li>
</ul>
</li>
<li><a href="#sec-4">4. string</a>
<ul>
<li><a href="#sec-4-1">4.1. count(sub, [start [, end]])</a></li>
<li><a href="#sec-4-2">4.2. find(sub, [start [, end]])</a></li>
<li><a href="#sec-4-3">4.3. isalpha isdigit isalnum islower isupper istitle isspace</a></li>
<li><a href="#sec-4-4">4.4. lower upper title swapcase</a></li>
<li><a href="#sec-4-5">4.5. ljust rjust center</a></li>
<li><a href="#sec-4-6">4.6. split rsplit lsplit</a></li>
<li><a href="#sec-4-7">4.7. strip lstrip rstrip</a></li>
<li><a href="#sec-4-8">4.8. replace(old, new[, count]) -&gt;string</a></li>
<li><a href="#sec-4-9">4.9. startswith</a></li>
</ul>
</li>
<li><a href="#sec-5">5. map</a>
<ul>
<li><a href="#sec-5-1">5.1. keys values</a></li>
<li><a href="#sec-5-2">5.2. get(k[, d])</a></li>
</ul>
</li>
<li><a href="#sec-6">6. set</a>
<ul>
<li><a href="#sec-6-1">6.1. set(sequence)</a></li>
<li><a href="#sec-6-2">6.2. |</a></li>
<li><a href="#sec-6-3">6.3. &amp;</a></li>
<li><a href="#sec-6-4">6.4. -</a></li>
<li><a href="#sec-6-5">6.5. symmetric_difference</a></li>
<li><a href="#sec-6-6">6.6. add</a></li>
<li><a href="#sec-6-7">6.7. clear</a></li>
<li><a href="#sec-6-8">6.8. pop remove</a></li>
<li><a href="#sec-6-9">6.9. update union_update intersection_update difference_update symmetric_difference_update</a></li>
<li><a href="#sec-6-10">6.10. issubset issuperset isdisjoint</a></li>
</ul>
</li>
<li><a href="#sec-7">7. len()</a></li>
<li><a href="#sec-8">8. type()</a></li>
<li><a href="#sec-9">9. str()</a></li>
<li><a href="#sec-10">10. repr()</a></li>
<li><a href="#sec-11">11. //除</a></li>
<li><a href="#sec-12">12. print 默认回车</a></li>
<li><a href="#sec-13">13. math.trunc()</a></li>
<li><a href="#sec-14">14. math.floor()</a></li>
<li><a href="#sec-15">15. oct() hex() bin()</a></li>
<li><a href="#sec-16">16. int()</a></li>
<li><a href="#sec-17">17. eval()</a></li>
<li><a href="#sec-18">18. bit_length()</a></li>
<li><a href="#sec-19">19. math.pi math.e math.sin() math.sqrt() math.pow() pow() abs() min() max()</a></li>
<li><a href="#sec-20">20. random module</a>
<ul>
<li><a href="#sec-20-1">20.1. random.random()</a></li>
<li><a href="#sec-20-2">20.2. random.randint(a, b)</a></li>
<li><a href="#sec-20-3">20.3. random.choice(self, seq)</a></li>
</ul>
</li>
<li><a href="#sec-21">21. zip</a>
<ul>
<li><a href="#sec-21-1">21.1. 利用zip构造字典</a></li>
</ul>
</li>
<li><a href="#sec-22">22. enumerate</a></li>
<li><a href="#sec-23">23. reduce</a></li>
<li><a href="#sec-24">24. str.maketrans/str.translate</a></li>
<li><a href="#sec-25">25. chr/ord</a></li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../layout/css/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../layout/css/style.css" />
<script src="../../layout/js/jquery_1.7.1.js"></script>
<script src="../../layout/js/bootstrap_old.js"></script>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 3.X中print()</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
在python3.2:
print(value, ..., sep=' ', end='\n', file=sys.stdout)
sep表示输出之间的符号，end表示整个输出的结束符。

&gt;&gt;&gt; print('hello', 'world')
hello world
&gt;&gt;&gt; print('hello', 'world', sep='\n')
hello  #Because sep is \n, this is a new line.
world
&gt;&gt;&gt; print('hello', 'world', end=' ')
hello world &gt;&gt;&gt;  #Because end is ' ', so this is no newline.
</pre>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> lists:</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> list()</h3>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> reverse()</h3>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> sort() sorted()</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
sorted(iterable, cmp=None, key=None, reverse=False) --&gt; new sorted list
L.sort(cmp=None, key=None, reverse=False) -- stable sort *IN PLACE*;

区别在：sorted是built-in 函数， sort是list的成员函数。前者作用于列表但并不对列表造成影响，后才修改了列表。

iterable 可迭代的类药
cmp 比较函数
key 用列表元素的某个属性和函数进行作为关键字
reverse 排序规则
一般cmp，key 可以用lambda表达式，效率key&gt;cmp

&gt;&gt;&gt;L = [('b',2),('a',1),('c',3),('d',4)]
&gt;&gt;&gt;print sorted(L, cmp=lambda x,y:cmp(x[1],y[1]))
[('a', 1), ('b', 2), ('c', 3), ('d', 4)]

&gt;&gt;&gt;L = [('b',2),('a',1),('c',3),('d',4)]
&gt;&gt;&gt;print sorted(L, key=lambda x:x[1]))
[('a', 1), ('b', 2), ('c', 3), ('d', 4)]

&gt;&gt;&gt; print sorted([5, 2, 3, 1, 4], reverse=True)
[5, 4, 3, 2, 1]
&gt;&gt;&gt; print sorted([5, 2, 3, 1, 4], reverse=False)
[1, 2, 3, 4, 5]
</pre>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> insert()</h3>
<div class="outline-text-3" id="text-2-4">
<pre class="example">
L.insert(index, object)   # Insert object before index
</pre>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> pop([index])</h3>
<div class="outline-text-3" id="text-2-5">
<p>
L.pop([index]) # Remove and return item at index (defaut last)<br/>
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> remove(value)</h3>
<div class="outline-text-3" id="text-2-6">
<pre class="example">
L.remove(value)   # Remove fist occurence of value.
</pre>
</div>
</div>
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> count(value)</h3>
<div class="outline-text-3" id="text-2-7">
<p>
L.count(value) # Return number of occurrences of value.<br/>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> integers:</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> ord()</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
ord('字符') #返回ASCII码
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> string</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> count(sub, [start [, end]])</h3>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> find(sub, [start [, end]])</h3>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> isalpha isdigit isalnum islower isupper istitle isspace</h3>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> lower upper title swapcase</h3>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> ljust rjust center</h3>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> split rsplit lsplit</h3>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> strip lstrip rstrip</h3>
</div>
<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> replace(old, new[, count]) -&gt;string</h3>
</div>
<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> startswith</h3>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> map</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> keys values</h3>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> get(k[, d])</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Dict.get(k[, d])等价于 Dict[k] if k in Dict else d<br/>
避免获取不存在的字典键而产生错误<br/>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> set</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> set(sequence)</h3>
<div class="outline-text-3" id="text-6-1">
<p>
X=set('spam') 等价于 X = {'s', 'p', 'a', 'm'}<br/>
</p>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> |</h3>
<div class="outline-text-3" id="text-6-2">
<p>
X|Y 等价于 X.union(Y)<br/>
</p>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> &amp;</h3>
<div class="outline-text-3" id="text-6-3">
<p>
intersection<br/>
</p>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> -</h3>
<div class="outline-text-3" id="text-6-4">
<p>
difference<br/>
</p>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> symmetric_difference</h3>
<div class="outline-text-3" id="text-6-5">
<p>
对称差<br/>
</p>
</div>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> add</h3>
<div class="outline-text-3" id="text-6-6">
<p>
添加一个元素（保证集合的不重复性）<br/>
</p>
</div>
</div>

<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> clear</h3>
</div>
<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> pop remove</h3>
</div>
<div id="outline-container-sec-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="section-number-3">6.9</span> update union_update intersection_update difference_update symmetric_difference_update</h3>
<div class="outline-text-3" id="text-6-9">
<p>
更新、用取并结果更新原来集合……<br/>
</p>
</div>
</div>

<div id="outline-container-sec-6-10" class="outline-3">
<h3 id="sec-6-10"><span class="section-number-3">6.10</span> issubset issuperset isdisjoint</h3>
<div class="outline-text-3" id="text-6-10">
<p>
子集、父集、不相交集<br/>
</p>
<script src="../../layout/js/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> len()</h2>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> type()</h2>
<div class="outline-text-2" id="text-8">
<p>
查看类型<br/>
type(X) <code>= set    #判断X是不是set类型<br/>
  type(D) =</code> dict<br/>
isinstance(D, dict) 与上行等价<br/>
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> str()</h2>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> repr()</h2>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> //除</h2>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> print 默认回车</h2>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> math.trunc()</h2>
<div class="outline-text-2" id="text-13">
<pre class="example">
去除浮点后面的
因为版本问题：在2.6中 3/2=&gt;1，而在3.0中 3/2 =&gt;1.5。为避免版本引起的问题，可以用math.trunc().math.trunc(3/2)=&gt;1
</pre>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> math.floor()</h2>
<div class="outline-text-2" id="text-14">
<pre class="example">
&gt;&gt;&gt; math.floor(2.5)
2.0
&gt;&gt;&gt; math.floor(-2.5)
-3.0
</pre>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> oct() hex() bin()</h2>
<div class="outline-text-2" id="text-15">
<pre class="example">
把10进制整数转化成8 16 2进制字符串
2.6版本中8进制前面加0，3.0版本中前面加0o
&gt;&gt;&gt; oct(64), hex(64), bin(64)
('0100', '0x40', '0b1000000')
</pre>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> int()</h2>
<div class="outline-text-2" id="text-16">
<pre class="example">
int(x[, base]) -&gt; integer
把一个数字的字符串变换为整数，其中base指定指定x的进制。
&gt;&gt;&gt; int('64'), int('100', 8), int('40', 16), int('1000000', 2)
(64, 64, 64, 64)
&gt;&gt;&gt; int('0x40', 16), int('0b1000000', 2) #与上面等价
(64, 64)
</pre>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> eval()</h2>
</div>
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> bit_length()</h2>
<div class="outline-text-2" id="text-18">
<pre class="example">
#以二进制查询表示一个数字的什所需的位数
&gt;&gt;&gt; (256).bit_length()
9
&gt;&gt;&gt; len(bin(256)) - 2
9
</pre>
</div>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> math.pi math.e math.sin() math.sqrt() math.pow() pow() abs() min() max()</h2>
<div class="outline-text-2" id="text-19">
<pre class="example">
python中有三种方法可以计算平方根：
import math
math.sqrt(144)
pow(144, .5)
144 ** .5
</pre>
<hr/>
<pre class="example">
pow(x, y[, z]) -&gt; number
通常是两个参数，若三个则表示 (x ** y) % z
</pre>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> random module</h2>
<div class="outline-text-2" id="text-20">
</div><div id="outline-container-sec-20-1" class="outline-3">
<h3 id="sec-20-1"><span class="section-number-3">20.1</span> random.random()</h3>
<div class="outline-text-3" id="text-20-1">
<p>
随机生成0-1之间的小数<br/>
</p>
</div>
</div>

<div id="outline-container-sec-20-2" class="outline-3">
<h3 id="sec-20-2"><span class="section-number-3">20.2</span> random.randint(a, b)</h3>
<div class="outline-text-3" id="text-20-2">
<p>
随机生成a-b之间的娄<br/>
&gt;&gt;&gt; random.randint(1, 10)<br/>
5<br/>
</p>
</div>
</div>

<div id="outline-container-sec-20-3" class="outline-3">
<h3 id="sec-20-3"><span class="section-number-3">20.3</span> random.choice(self, seq)</h3>
<div class="outline-text-3" id="text-20-3">
<p>
随机从序列中挑选<br/>
&gt;&gt;&gt; random.choice(['a', 'b', 'c'])<br/>
'c'<br/>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> zip</h2>
<div class="outline-text-2" id="text-21">
<pre class="example">
zip(seq1, seq2, seq3...)=&gt; [(seq1[0], seq2[0]...), (seq1[1], seq2[1]...), ...]
</pre>
</div>
<div id="outline-container-sec-21-1" class="outline-3">
<h3 id="sec-21-1"><span class="section-number-3">21.1</span> 利用zip构造字典</h3>
<div class="outline-text-3" id="text-21-1">
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a0522d;">d1</span>=(<span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'b'</span>, <span style="color: #8b2252;">'c'</span>)
&gt;&gt;&gt; <span style="color: #a0522d;">d2</span>=(1,2,3)
&gt;&gt;&gt; <span style="color: #483d8b;">dict</span>(<span style="color: #483d8b;">zip</span>(d1,d2))
{<span style="color: #8b2252;">'a'</span>: 1, <span style="color: #8b2252;">'c'</span>: 3, <span style="color: #8b2252;">'b'</span>: 2}
&gt;&gt;&gt; <span style="color: #a0522d;">d</span> = <span style="color: #483d8b;">dict</span>(<span style="color: #483d8b;">zip</span>(d1,d2))
&gt;&gt;&gt; d[<span style="color: #8b2252;">"a"</span>]
1
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> enumerate</h2>
<div class="outline-text-2" id="text-22">
<pre class="example">
enumerate(iterable[, start]) -&gt; iterator for index, value of iterable
</pre>
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #a0522d;">s</span>=<span style="color: #8b2252;">'spam'</span>
&gt;&gt;&gt; <span style="color: #a020f0;">for</span> (offset, item) <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">enumerate</span>(s):
...     <span style="color: #a020f0;">print</span> (offset, item)
... 
(0, <span style="color: #8b2252;">'s'</span>)
(1, <span style="color: #8b2252;">'p'</span>)
(2, <span style="color: #8b2252;">'a'</span>)
(3, <span style="color: #8b2252;">'m'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> reduce</h2>
<div class="outline-text-2" id="text-23">
<pre class="example">
reduce(function, sequence[, initial]) -&gt; value
</pre>
<p>
initial可选，当sequence为空结果为该值。<br/>
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #483d8b;">reduce</span>(<span style="color: #a020f0;">lambda</span> x,y:x*y, [1,2,3,4,5,6,7]) =&gt;(((((1*2)*3)*4)*5)*6)*7
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> str.maketrans/str.translate</h2>
<div class="outline-text-2" id="text-24">
<p>
用来从一个字符串翻译到另一个字符串<br/>
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a0522d;">before</span> = <span style="color: #8b2252;">'koe'</span>
<span style="color: #a0522d;">after</span> = <span style="color: #8b2252;">'mqg'</span>
<span style="color: #a0522d;">trantab</span> = maketrans(before, after)
<span style="color: #a020f0;">print</span> <span style="color: #8b2252;">'koe'</span>.translate(trantab)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> chr/ord</h2>
<div class="outline-text-2" id="text-25">
<p>
chr(数字) 将数字转换为对应的ASCII码<br/>
ord(char) 将char转换为对应的ASCII值<br/>
</p>
<script src="../../layout/js/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>
</div>
</div>
</body>
</html>
